#  Updating Rows and Columns - Modifying Data Within DataFrames

In [1]:
import pandas as pd
info={
    'first':['junaid','yasir','saddam'],
     'last':['shinwari','khan','hussain'],
     'email':['junaid@gmail.com','yasir@gmail.com','saddam@gmail.com']
}

df=pd.DataFrame(info)
df

    first      last             email
0  junaid  shinwari  junaid@gmail.com
1   yasir      khan   yasir@gmail.com
2  saddam   hussain  saddam@gmail.com

In [2]:
#change the columns 
df.columns=['first_name','last_name','email']

In [3]:
# for lower and upper we do list comprehension
#df.columns=[x.upper() for x in df.columns]
#df

In [4]:
df.columns=df.columns.str.replace('_','')
df

  firstname  lastname             email
0    junaid  shinwari  junaid@gmail.com
1     yasir      khan   yasir@gmail.com
2    saddam   hussain  saddam@gmail.com

In [5]:
df.columns=[x.lower() for x in df.columns]

In [6]:
df.rename(columns={'first_name':'fisrt','last_name':'last'}, inplace=True)
df

  firstname  lastname             email
0    junaid  shinwari  junaid@gmail.com
1     yasir      khan   yasir@gmail.com
2    saddam   hussain  saddam@gmail.com

In [7]:
#it will update the 2 rows all values
df.loc[2]=['irshad','khan','irshad@gmail.com']
df

  firstname  lastname             email
0    junaid  shinwari  junaid@gmail.com
1     yasir      khan   yasir@gmail.com
2    irshad      khan  irshad@gmail.com

In [8]:
#changing some specific columns values
df.loc[2,['last','email']]=['swat','irshadkhan@gmail.com']
df
df.loc[0,'last']='khan'
df

  firstname  lastname                 email  last
0    junaid  shinwari      junaid@gmail.com  khan
1     yasir      khan       yasir@gmail.com   NaN
2    irshad      khan  irshadkhan@gmail.com  swat

In [9]:
df.loc[2,['lastname','email']]=['swat','irshadkhan@gmail.com']
df

  firstname  lastname                 email  last
0    junaid  shinwari      junaid@gmail.com  khan
1     yasir      khan       yasir@gmail.com   NaN
2    irshad      swat  irshadkhan@gmail.com  swat

In [13]:
df.loc[2, 'lastname'] = 'khan'

In [33]:
df.loc[0:2,'_e_m_a_i_l_']=['jfkad','djfd','kdfkdl']
df

  _f_i_r_s_t_n_a_m_e_ _l_a_s_t_n_a_m_e_ _e_m_a_i_l_ _l_a_s_t_ last   email
0              junaid          shinwari       jfkad      khan  NaN   jfkad
1               yasir              khan        djfd       NaN  NaN    djfd
2              irshad              khan      kdfkdl      khan  Doe  kdfkdl

In [39]:
df.columns=df.columns.str.replace('_',' ')

   f i r s t n a m e   l a s t n a m e   e m a i l   l a s t  last   email
0              junaid          shinwari       jfkad      khan  NaN   jfkad
1               yasir              khan        djfd       NaN  NaN    djfd
2              irshad              khan      kdfkdl      khan  Doe  kdfkdl

In [41]:
df['email'] = df['email'].str.lower()

In [42]:
df

   f i r s t n a m e   l a s t n a m e   e m a i l   l a s t  last   email
0              junaid          shinwari       jfkad      khan  NaN   jfkad
1               yasir              khan        djfd       NaN  NaN    djfd
2              irshad              khan      kdfkdl      khan  Doe  kdfkdl

In [43]:
df['email'].apply(len)

0    5
1    4
2    6
Name: email, dtype: int64

In [44]:
def update_email(email):
    return email.upper()
df['email'].apply(update_email)

0     JFKAD
1      DJFD
2    KDFKDL
Name: email, dtype: object

In [45]:
df

   f i r s t n a m e   l a s t n a m e   e m a i l   l a s t  last   email
0              junaid          shinwari       jfkad      khan  NaN   jfkad
1               yasir              khan        djfd       NaN  NaN    djfd
2              irshad              khan      kdfkdl      khan  Doe  kdfkdl

In [46]:
#to store the result permantly 
df['email'] = df['email'].apply(update_email)

In [47]:
df

   f i r s t n a m e   l a s t n a m e   e m a i l   l a s t  last   email
0              junaid          shinwari       jfkad      khan  NaN   JFKAD
1               yasir              khan        djfd       NaN  NaN    DJFD
2              irshad              khan      kdfkdl      khan  Doe  KDFKDL

In [48]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [49]:
df

   f i r s t n a m e   l a s t n a m e   e m a i l   l a s t  last   email
0              junaid          shinwari       jfkad      khan  NaN   jfkad
1               yasir              khan        djfd       NaN  NaN    djfd
2              irshad              khan      kdfkdl      khan  Doe  kdfkdl

In [53]:
#apply method is apply the length function on each values in the email columns or series
df['email'].apply(len)
#but when we use this apply methond on whole data frame it will only gives the every columns values
#we can also say it will gives the rows in each columns
df.apply(len)
del df['email']

KeyError: 'email'

In [54]:
df

   f i r s t n a m e   l a s t n a m e   e m a i l   l a s t  last
0              junaid          shinwari       jfkad      khan  NaN
1               yasir              khan        djfd       NaN  NaN
2              irshad              khan      kdfkdl      khan  Doe

In [55]:
del df['last']

In [56]:
df

   f i r s t n a m e   l a s t n a m e   e m a i l   l a s t
0              junaid          shinwari       jfkad      khan
1               yasir              khan        djfd       NaN
2              irshad              khan      kdfkdl      khan

In [66]:
#for rows
df.apply(len, axis='columns')
#it will shown on row 0 there is total 4 and 1 also 4 and so on

0    4
1    4
2    4
dtype: int64

In [67]:
#to get the min values from each series
#df.apply(pd.Series.min)
#df.apply(lambda x: x.min())

In [73]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [75]:
dff=pd.DataFrame(people)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [76]:
#it will apply the length function on every individuil values in data frame
dff.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     3     17

In [77]:
#it is apply on series
#map accepts a dict or a Series
#As you can see for s.map method, values that are not found in the dict are converted to NaN
df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [78]:
df['first'] = df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

In [79]:
df

   first     last                    email
0  Chris  Schafer  CoreyMSchafer@gmail.com
1   Mary      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com